---
kind: method
id: M:Autodesk.Revit.DB.CurveArrArray.Append(Autodesk.Revit.DB.CurveArray)
source: html/eb088566-3e64-4150-69e7-aecfbb0d6ad6.htm
---
# Autodesk.Revit.DB.CurveArrArray.Append Method

## Syntax (C#)
```csharp
public virtual void Append(
	CurveArray item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.CurveArray`)